# tests/constants.py

SUBJECT_MAPPING = {
    'science': 'Естествознание',
    'math': 'Математика',
    'logic': 'Логика и количественные характеристики',
    'Kazakh': 'Казахский язык',
    'Russian': 'Русский язык',
    'English': 'Английский язык'
    # При необходимости добавьте другие предметы
}

SECTION_MAPPING = {
    'world_science': 'Мир науки',
    'human_earth': 'Человек, Земля, Вселенная',
    'materials': 'Вещества и материалы',
    'nature': 'Живая/Неживая природа',
    'energy_motion': 'Энергия и движение',
    'ecology': 'Экология и экосистемы',
    'politics': 'Политическая карта',
}
